STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA65RI/Applications/BLE/BLE_HeartRateFreeRTOS/Core/Src/app_entry.c
static osThreadId_t     PKACtrlTaskHandle;
static osSemaphoreId_t  PKACtrlSemaphore;

static const osThreadAttr_t PKACtrlTask_attributes = {
  .name         = "PKACTRL Task",
  .priority     = TASK_PRIO_PKACTRL,
  .stack_size   = TASK_STACK_SIZE_PKACTRL,
  .attr_bits    = TASK_DEFAULT_ATTR_BITS,
  .cb_mem       = TASK_DEFAULT_CB_MEM,
  .cb_size      = TASK_DEFAULT_CB_SIZE,
  .stack_mem    = TASK_DEFAULT_STACK_MEM
};

static const osSemaphoreAttr_t PKACtrlSemaphore_attributes = {
  .name         = "PKACTRL Semaphore",
  .attr_bits    = TASK_DEFAULT_ATTR_BITS,
  .cb_mem       = TASK_DEFAULT_CB_MEM,
  .cb_size      = TASK_DEFAULT_CB_SIZE
};

static osMutexId_t      crcCtrlMutex;

static const osMutexAttr_t crcCtrlMutex_attributes = {
  .name         = "CRC CTRL Mutex",
  .attr_bits    = TASK_DEFAULT_ATTR_BITS,
  .cb_mem       = TASK_DEFAULT_CB_MEM,
  .cb_size      = TASK_DEFAULT_CB_SIZE
};

#if (USE_TEMPERATURE_BASED_RADIO_CALIBRATION == 1)
static osMutexId_t      adcCtrlMutex;

static const osMutexAttr_t adcCtrlMutex_attributes = {
  .name         = "ADC CTRL Mutex",
  .attr_bits    = TASK_DEFAULT_ATTR_BITS,
  .cb_mem       = TASK_DEFAULT_CB_MEM,
  .cb_size      = TASK_DEFAULT_CB_SIZE
};
#endif /* USE_TEMPERATURE_BASED_RADIO_CALIBRATION */

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/
/* FreeRTOS objects declaration */
/* USER CODE BEGIN GV */

/* USER CODE END GV */

/* Private functions prototypes-----------------------------------------------*/
static void System_Init( void );
static void SystemPower_Config( void );
static void Config_HSE(void);
static void APPE_RNG_Init( void );

static void APPE_AMM_Init(void);
static void AMM_Task_Entry(void* argument);
static void AMM_WrapperInit(uint32_t * const p_PoolAddr, const uint32_t PoolSize);
static uint32_t * AMM_WrapperAllocate(const uint32_t BufferSize);
static void AMM_WrapperFree(uint32_t * const p_BufferAddr);

static void RNG_Task_Entry(void* argument);

static void APPE_FLASH_MANAGER_Init( void );
static void FLASH_Manager_Task_Entry(void* argument);

static void APPE_PKACTRL_Init( void );
int PKACTRL_MutexTake(void);
int PKACTRL_MutexRelease(void);
int PKACTRL_TakeSemEndOfOperation(void);
int PKACTRL_ReleaseSemEndOfOperation(void);
static void PKACTRL_Task_Entry(void* argument);

static void TimerOsTickCb(void *arg);
#if (HAL_TICK_RTC == 1)
static void TimerHalTickCb(void *arg);
static void HAL_StartTick(void);
#endif /* HAL_TICK_RTC */
#if ( CFG_LPM_LEVEL != 0)
static void TimerOSwakeupCB(void *arg);
static uint32_t getCurrentTime(void);
#endif /* CFG_LPM_LEVEL */

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* External variables --------------------------------------------------------*/

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Functions Definition ------------------------------------------------------*/
/**
 * @brief   Wireless Private Area Network configuration.
 */
void MX_APPE_Config(void)
{
  /* Configure HSE Tuning */
  Config_HSE();
}

/**
 * @brief   Wireless Private Area Network initialisation.
 */
uint32_t MX_APPE_Init(void *p_param)
{
  APP_DEBUG_SIGNAL_SET(APP_APPE_INIT);

  UNUSED(p_param);

  /* System initialization */
  System_Init();

  /* Configure the system Power Mode */
  SystemPower_Config();

#if (USE_TEMPERATURE_BASED_RADIO_CALIBRATION == 1)
  /* Initialize the Temperature measurement */
  TEMPMEAS_Init ();
#endif /* (USE_TEMPERATURE_BASED_RADIO_CALIBRATION == 1) */

  /* Initialize the Advance Memory Manager module */
  APPE_AMM_Init();

  /* Initialize the Random Number Generator module */
  APPE_RNG_Init();

  /* Initialize the Flash Manager module */
  APPE_FLASH_MANAGER_Init();

  /* Create PKA semaphore */
  PkaSemaphore = osSemaphoreNew(1U,
                                1U,
                                &PkaSemaphore_attributes);
  if (PkaSemaphore == NULL)
  {
    LOG_ERROR_APP( "PKA Semaphore FreeRTOS objects creation FAILED");
    Error_Handler();
  }
  /* Create PKA end of operation flag semaphore */
  PkaEndOfOperationSemaphore = osSemaphoreNew(1U,
                                              1U,
                                              &PkaEndOfOperationSemaphore_attributes);
  if (PkaEndOfOperationSemaphore == NULL)
  {
    LOG_ERROR_APP( "PKA End of Operation Semaphore FreeRTOS objects creation FAILED");
    Error_Handler();
  }
  /* USER CODE BEGIN APPE_Init_1 */
#if (CFG_LED_SUPPORTED == 1)
  APP_BSP_LedInit();
#endif /* (CFG_LED_SUPPORTED == 1) */
#if (CFG_BUTTON_SUPPORTED == 1)
  APP_BSP_ButtonInit();
#endif /* (CFG_BUTTON_SUPPORTED == 1) */

  /* USER CODE END APPE_Init_1 */

  crcCtrlMutex = osMutexNew(&crcCtrlMutex_attributes);
  if (crcCtrlMutex == NULL)
  {
    LOG_ERROR_APP( "CRC CTRL FreeRTOS mutex creation FAILED");
    Error_Handler();
  }

#if (USE_TEMPERATURE_BASED_RADIO_CALIBRATION == 1)
  adcCtrlMutex = osMutexNew(&adcCtrlMutex_attributes);
  if (adcCtrlMutex == NULL)
  {
    LOG_ERROR_APP( "ADC CTRL FreeRTOS mutex creation FAILED");
    Error_Handler();
  }
#endif /* USE_TEMPERATURE_BASED_RADIO_CALIBRATION */

  /* Initialize the Public Key Accelerator module */
  APPE_PKACTRL_Init();

  /* Initialize the Simple Non Volatile Memory Arbiter */
  if( SNVMA_Init((uint32_t *)CFG_SNVMA_START_ADDRESS) != SNVMA_ERROR_OK )
  {
    Error_Handler();
  }

  APP_BLE_Init();

  /* Disable RFTS Bypass for flash operation - Since LL has not started yet */
  FD_SetStatus (FD_FLASHACCESS_RFTS_BYPASS, LL_FLASH_DISABLE);

#if ( CFG_LPM_LEVEL != 0)
  /* create a SW timer to wakeup system from low power */
  UTIL_TIMER_Create(&TimerOSwakeup_Id,
                    0,
                    UTIL_TIMER_ONESHOT,
                    &TimerOSwakeupCB, 0);

  maximumPossibleSuppressedTicks = UINT32_MAX;
#endif /* ( CFG_LPM_LEVEL != 0) */

  /* USER CODE BEGIN APPE_Init_2 */

  /* USER CODE END APPE_Init_2 */

  APP_DEBUG_SIGNAL_RESET(APP_APPE_INIT);

  return WPAN_SUCCESS;
}

/* USER CODE BEGIN FD */

/* USER CODE END FD */

